class Paragraph {
  final String text = """
  История – одна из древнейших и увлекательнейших областей человеческого  знания, духовной культуры. В рейтинговой таблице ЮНЕСКО  история занимает четвёртое место среди современных наук.
«История» – древнегреческое слово. В переводе оно означает «исследование», «повествование» и «рассказ о прошедших событиях».
«Отцом истории» считается Геродот,  живший в Древней Греции в V в. до н. э.
  """;
  final String imagePath = 'assets/images/paragraphs/paragraph1/Gerodot.jpg';
  final String text2 = """
Геродот, древнегреческий историк, отец исторической науки.
Геродот Галикарнасский (484 – 425 до н. э.) – древнегреческий историк, автор первого полномасштабного исторического трактата – «Истории», – описывающего греко-персидские войны и обычаи многих современных его автору народов. Труды Геродота имели огромное значение для античной культуры. Цицерон назвал его “отцом истории”. Его «История» – чрезвычайно важный источник сведений о Великой Скифии, включавший в себя информацию о жизни наших далёких предков.  
  """;
  final String text3 = """
Уже  в  глубокой  древности  сформировались  два  противоположных  направления в понимании вопросов исторического развития – идеалистическое и материалистическое.  
  """;

  final String table1Header = "Основные направления в понимании вопросов  исторического развития";
  final String table1Left = "Идеалистическое";
  final String table1Right = "Материалистическое";
  final String table1LeftText = """Идеалистическое понимание истории  абсолютизировало  роль  сознания  в  жизни  общества  и  превращало  его  в  конечную  и  определяющую силу исторического процесса. Все происходящие в  экономике и других материальных  сферах  жизнедеятельности  общества изменения для него выступали  вторичными,  определяемыми  сознанием.  Таким  образом,  идеалисты  утверждали,  что  основу  общественного  развития  определяет  уровень  духовно-нравственного сознания человека. Историю  творит человек, но его разум – от  Бога.  Такое  миропонимание  долгое время господствовало в исторической науке""";
  final String table1RightText = """В  основе  противоположной  идеализму  диалектико-материалистической  концепции  понимания  истории  лежит  положение о зависимости сознания от бытия. Общественное  бытие,  условия  жизнедеятельности  людей  –  это  и  есть  та  объективная  общественная  реальность,  своего  рода  социальная  материя,  которая  отражается  в  общественном сознании, определяет его и обуславливает, в конечном  счете,  его  развитие,  его «взлеты» и «падения».""";

  final String text4 = """
  Со времени возникновения эти два направления ведут острую борьбу,  пытаясь доказать обоснованность, правильность и логичность своих  положений. Противостояние между ними обуславливало развитие науки об обществе. Вплоть до середины XIX века господствовала теория  идеалистического понимания истории. И сегодня в определенных научных кругах Запада она продолжает занимать ведущее место.
  """;

}

