class Paragraph {
  final String text = """
  История – одна из древнейших и увлекательнейших областей человеческого  знания, духовной культуры. В рейтинговой таблице ЮНЕСКО  история занимает четвёртое место среди современных наук.
«История» – древнегреческое слово. В переводе оно означает «исследование», «повествование» и «рассказ о прошедших событиях».
«Отцом истории» считается Геродот,  живший в Древней Греции в V в. до н. э.
  """;
  final String imagePath = 'assets/images/paragraphs/paragraph1/Gerodot.jpg';
  final String text2 = """
Геродот, древнегреческий историк, отец исторической науки.
Геродот Галикарнасский (484 – 425 до н. э.) – древнегреческий историк, автор первого полномасштабного исторического трактата – «Истории», – описывающего греко-персидские войны и обычаи многих современных его автору народов. Труды Геродота имели огромное значение для античной культуры. Цицерон назвал его “отцом истории”. Его «История» – чрезвычайно важный источник сведений о Великой Скифии, включавший в себя информацию о жизни наших далёких предков.  
  """;
  final String text3 = """
Уже  в  глубокой  древности  сформировались  два  противоположных  направления в понимании вопросов исторического развития – идеалистическое и материалистическое.  
  """;

  final String table1Header = "Основные направления в понимании вопросов  исторического развития";
  final String table1Left = "Идеалистическое";
  final String table1Right = "Материалистическое";
  final String table1LeftText = """Идеалистическое понимание истории  абсолютизировало  роль  сознания  в  жизни  общества  и  превращало  его  в  конечную  и  определяющую силу исторического процесса. Все происходящие в  экономике и других материальных  сферах  жизнедеятельности  общества изменения для него выступали  вторичными,  определяемыми  сознанием.  Таким  образом,  идеалисты  утверждали,  что  основу  общественного  развития  определяет  уровень  духовно-нравственного сознания человека. Историю  творит человек, но его разум – от  Бога.  Такое  миропонимание  долгое время господствовало в исторической науке""";
  final String table1RightText = """В  основе  противоположной  идеализму  диалектико-материалистической  концепции  понимания  истории  лежит  положение о зависимости сознания от бытия. Общественное  бытие,  условия  жизнедеятельности  людей  –  это  и  есть  та  объективная  общественная  реальность,  своего  рода  социальная  материя,  которая  отражается  в  общественном сознании, определяет его и обуславливает, в конечном  счете,  его  развитие,  его «взлеты» и «падения».""";

  final String text4 = """
  Со времени возникновения эти два направления ведут острую борьбу,  пытаясь доказать обоснованность, правильность и логичность своих  положений. Противостояние между ними обуславливало развитие науки об обществе. Вплоть до середины XIX века господствовала теория  идеалистического понимания истории. И сегодня в определенных научных кругах Запада она продолжает занимать ведущее место.
  """;

  final String headerText = "Предмет истории";
  final String text5 = """Предмет  истории  определяется  неоднозначно.  Любое  определение  предмета истории субъективно, связано с идеологией государства и мировоззрением историка. Историки,  стоящие  на  материалистических  позициях,  считают,  что  история  как  наука  изучает  закономерности  развития  общества,  которые,  в конечном счёте, зависят от способа производства материальных благ. На основе материалистического подхода в учебниках и учебных пособиях даются следующие определения предмета истории:
""";

  final String boxText1 = "История – совокупность знаний и представлений о прошлом человечества.";
  final String boxText2 = "История – комплекс общественных наук, изучающих прошлое человечества во всей его конкретности и многообразии.";
  final String boxText3 = "История – наука, изучающая прошлое и настоящее человеческого общества в хронологической последовательности и взаимосвязи.";
  final String boxText4 = "История – наука, изучающая объективные законы исторического развития человеческого общества.";
  final String boxText5 = "История – наука, изучающая общественные явления в их возникновении и развитии в связи с конкретными историческими условиями.";
  final String boxText6 = "История – наука, изучающая прошлое человеческого  общества в неразрывной  связи  с  современной  жизнью  народов,  устанавливающая  законы развития общества на различных этапах его существования.";
  final String boxText7 = "История – наука, исследующая процесс развития человеческого общества в прошлом, а также его современное состояние, при котором раскрывается логика, закономерность его развития.";

  final String text6 = """В  зависимости  от  того,  что  является  предметом  изучения  истории,  выделяются Мировая (всемирная или всеобщая) история, история континентов  (например, Азии или Африки), отдельных стран (например, Кыргызстана). Мировая история – наука, о развитии человеческого общества с древнейших времён до наших дней на территории всего земного шара. Отечественная история – наука, о развитии человеческого общества  с древнейщих времён до настоящего времени, на территории какой-либо  страны. Таким образом, история Кыргызстана – наука, изучающая процессы  развития нашего Отечества; историю этносов, проживающих на территории  Кыргызстана, в первую очередь кыргызов; становление и формирование  государственных и общественных институтов; деятельность исторических  личностей.
""";

  final String table2Header = "Составные части исторической науки";
  final String table2LeftText = """Археология – наука, исследующая историю  общества по сохранившимся  материальным остаткам жизнедеятельности  человека  –  вещественным  памятникам:  орудиям  труда,  предметам  быта,  украшениям,  устройству жилища, захоронениям,  кладам и т. д.
""";
  final String table2RightText = """Этнография - изучает  особенности  материальной  и  духовной  культуры  народов,  их  культурно-исторические взаимоотношения.""";

  final String text7 = "В исторических исследованиях значительна роль вспомогательных наук,  которые, изучая конкретные области жизни, практики и культуры общества,  способствуют более глубокому осмыслению исторического процесса.";

  final String headerText2 = "Вспомогательные исторические дисциплины.";

  final String table3LeftText = "Хронология";
  final String table3RightText = "– изучает систему летоисчисления; ";
  final String table3LeftText2 = "Палеография";
  final String table3RightText2 = "– письменные памятники и историю письма; ";
  final String table3LeftText3 = "Нумизматика";
  final String table3RightText3 = "– историю монетной чеканки и денежного обращения  (по монетам, денежным знакам и т. д.), медальерного  искусства; ";
  final String table3LeftText4 = "Эпиграфика";
  final String table3RightText4 = "– древние письмена на камнях, металлических, деревянных, костянных изделиях; ";
  final String table3LeftText5 = "Генеалогия";
  final String table3RightText5 = "– происхождение народов, родов и фамилий; ";
  final String table3LeftText6 = "Геральдика";
  final String table3RightText6 = "– гербы государств, городов и исторических личностей;";
  final String table3LeftText7 = "Сфрагистика";
  final String table3RightText7 = "– печати; ";
  final String table3LeftText8 = "Топонимика";
  final String table3RightText8 = " – географические названия.";

  final String text8 = "Особое место среди вспомогательных дисциплин занимает источниковедение  (классификация  исторических  источников)  и  историография  (изучает историю самой исторической науки).";

  final String headerText3 = "Специально-исторические методы познания:";

  final String text9 = """
  • хронологический – изложение исторического материала в хронологической последовательности; • синхронный – одновременное изучение событий, происходящих в обществе; • дихронный – метод периодизации; • историческое моделирование – исследование исторических процессов  путём изучения их моделей (аналогов); • статистический – метод изучения  количественных исследований.
9
Принципы исторического познания • Историзм – рассмотрение фактов, событий в соответствии с конкретной  исторической обстановкой, во взаимосвязи, взаимообусловленности и в  развитии. • Объективность – каждое явление рассматривается в его  многогранности  и  противоречивости  (совокупности положительных и отрицательных  сторон). • Социальный подход – тенденциозность ( партийный или классовый подход): рассмотрение исторических процессов с учётом социальных интересов различных слоёв населения; соотношение классовых и групповых  интересов с общечеловеческими; учёт субъективного момента в практической деятельности правительств, партий, отдельных личностей. • Альтернативность – на основе объективных возможностей определяется  степень вероятности событий (процессов).
Функции исторического познания: • познавательная, человек постигает истину, добавляет новые знания в  свой интеллектуальный багаж. • политико-практическая – позволяет определять главные политические  ориентиры и приоритеты развития государства, предупреждает принятие  субъективных решений. • мировоззренческая – формирует в человеке объективное мировоззрение  и понимание закономерности общественного развития. • воспитательная – способствует становлению активного гражданского самосознания – формированию в  человеке таких личностных качеств, как  патриотизм, интернационализм, ответственность.
  """;

  final String scheme1Header = "Подходы к изучению истории";
  final String scheme1Text1 = "Религиозный";
  final String scheme1Text2 = "Формационный";
  final String scheme1Text3 = "Цивилизационный";

  final String headerText4 = "Периодизация истории";

  final String scheme2Header = "Религиозная (христианская) модель";
  final String scheme2Text1 = "От сотворения мира и человека, до изгнания Адама и  Евы из Рая.";
  final String scheme2Text2 = "От изгнания Адама и Евы  до Великого потопа и спасения Ноя.";
  final String scheme2Text3 = "От Ноя до рождения Иисуса Христа.";
  final String scheme2Text4 = "От рождения Иисуса Христа до Страшного суда.";

  final String scheme3Header = "Марксистская концепция исторического развития";
  final String scheme3Text1 = "Первобытнообщинная формация";
  final String scheme3Text2 = "Рабовладельческая формация";
  final String scheme3Text3 = "Феодализм";
  final String scheme3Text4 = "Капитализм";
  final String scheme3Text5 = "Коммунизм (социализм)";

  final String headerText5 = "Цивилизационный подход к изучению истории";

  final String text10 = """
  Термин «цивилизация» (от лат. civilis – гражданский, государственный,  политический, достойный гражданина) был введён в научный оборот французкими просветителями для обозначения общества, в котором царствуют  свобода, справедливость и правовой строй. Цивилизации – крупные целостные социо-культурные системы со своими закономерностями, которые включают в себя различные элементы (религию, экономическую, политическую, социальную организацию, систему  образования и  воспитания и т. д.). Каждый элемент этой системы несёт в  себе печать, своеобразие той или иной цивилизации. Сторонники цивилизационного подхода рассматривали историю как  последовательную смену культурно-исторических типов, или цивилизаций. Учёные выделяют более десяти типов цивилизаций. Цивилизацию можно определить как – способ жизнедеятельности человека в специфических условиях (климатических, географических, геополитических, историко-культурных и т. д.)
  """;

  final String headerText6 = "Типология цивилизаций";

  final String scheme4Header = "Цивилизации подразделяются на четыре основных типа";
  final String scheme4Text1 = "Природные сообщества";
  final String scheme4Text2 = "Восточный тип цивилизации";
  final String scheme4Text3 = "Западный тип цивилизации";
  final String scheme4Text4 = "Современный тип цивилизации  или глобальная цивилизация";

  final String boxText8 = "Природные сообщества";
  
  final String text11 = """
  Характерные черты. • живут в рамках природного годового цикла, в гармонии с природой; • адаптирование к окружающей среде которая необходима для поддержания  и воспроизводства жизни; • борьба за сохранение равновесия между человеком и природой; • сохранение сложившихся обычаев, традиций, методов труда; • в социальной организации господствует коллективизм: община, род, клан,  племя; • природное сообщество в основном ведет кочевой или полукочевой образ  жизни; • духовная культура, верования связаны с обожествлением сил природы. • средством интеллектуального и эммоционального освоения мира выступает мифология; • для этих сообществ характерен крайний традиционализм.
  """;

  final String table4LeftHeader = "Восточный тип (Восточная цивилизация)";
  final String table4RightHeader = "Западный тип (Западная цивилизация)";
  final String table4LeftText = """
  Исторически  первый  тип  цивилизации,  сформировавшийся  к  III  тысячалетию до н. э. в Древнем Востоке:  в Древней Индии, Китае, Месопотамии, Древнем Египте.
Характерные черты: • традиционализм  –  ориентация  на  воспроизводство сложившихся форм  и образа жизни; • медленное развитие всех форм человеческой жизнедеятельности; • в  мировоззренческом  плане  представление о полной несвободе человека, предопределение всех его действий и поступков независящими от  него силами природы, социума, богов и т. д.
• нравственно-волевая  установка  не  на  познание и преобразование мира, а на  созерцательность, безмятежность, мистическое единение с природой; • общественная  жизнь  построенная  на  принципах коллективизма; • политическая организация происходит  в форме деспотии, в которой осуществляется абсолютное преобладание государства над обществом; • экономическая основа – корпоративная  и государственная формы собственности, а основным методом управления  выступает принуждение.
  """;
  final String table4RightText = """
  Сформировался в Европе и  Северной Америке.
Характерные черты: • динамизм,  ориентация  на  новизну; • индивидуализм,  установка  на автономию личности; • уважение  к  частной  собственности; • рационализм; • идеалы  свободы,  равенства, терпимости;
• предпочтение  демократии  всем  другим  формам  государственного  управления.  Начиная  с  XVI – XVII вв.  в  развитии  западной  цивилизации  выделяется  особый  этап –  техногенная цивилизация, т. е. происходит научно-техническая революция и  распространяется  по  всему  земному шару.
  """; 

  final String boxtText9 = "Глобальная цивилизация (по-франц. «global» – «всеобщий», по-лат. «globus» – «земной шар»)";
  final text12 = """
  Это современный этап цивилизационного развития, характеризующийся возрастающей целостностью мирового сообщества, становлением единой  общепланетарной цивилизации. Это связано: • с интернационализацией общественной деятельности на земле; • с вхождением человечества в единую систему социально-экономических,  политических, культурных и иных связей и отношений; • распространение по всей планете всех форм социальной, экономической и  культурной жизни, знаний и ценностей; • унификация социокультурной жизни различных стран и регионов земного  шара; • создание общепланетарной системы общественного разделения труда, политических институтов, информации, связи, транспорта и т. д.; • усвоение  прогрессивного  опыта  при  сохранении  особенности  каждого  общества, культуры и менталитета народа; • усиление однородности социальных, экономических и политических форм  и сочетание их с культурным многообразием.
  """;
}